export const questions = [
    {
        id: 0,
        text: 'Что Вы больше всего цените в своей работе? Можете дать один или два варианта ответа:',
        quantity: 2,
        valuesArray: [
            {
                id: 1,
                text: 'то, что я в основном сам решаю, что и как мне делать;',
            },
            {
                id: 2,
                text: 'то, что она дает мне возможность проявить то, что я знаю и умею;',
            },
            {
                id: 3,
                text: 'то, что я чувствую себя полезным и нужным;',
            },
            {
                id: 4,
                text: 'то, что мне за неё относительно неплохо платят;',
            },
            {
                id: 5,
                text: 'особенно ничего не ценю, но эта работа мне хорошо знакома и привычна.',
            },
        ],
    },
    {
        id: 1,
        text: 'Какое выражение из перечисленных ниже Вам подходит более всего? Дайте только один ответ:',
        quantity: 1,
        valuesArray: [
            {
                id: 1,
                text: 'я хочу обеспечить своим трудом себе и своей семье приличный доход;',
            },
            {
                id: 2,
                text: 'в своей работе я полный хозяин;',
            },
            {
                id: 3,
                text: 'у меня достаточно знаний и опыта, чтобы справиться с любыми трудностями в моей работе;',
            },
            {
                id: 4,
                text: 'я ценный, незаменимый для организации работник;',
            },
            {
                id: 5,
                text: 'я всегда выполняю то, что от меня требуют.',
            },
        ],
    },
    {
        id: 2,
        text: 'Как Вы предпочитаете работать? Можете дать один или два варианта ответа:',
        quantity: 2,
        valuesArray: [
            {
                id: 1,
                text: 'предпочитаю делать то, что знакомо, привычно;',
            },
            {
                id: 2,
                text: 'нужно, чтобы в работе постоянно появлялось что-то новое, чтобы не стоять на месте;',
            },
            {
                id: 3,
                text: 'чтобы было точно известно, что нужно сделать и что я за это получу;',
            },
            {
                id: 4,
                text: 'предпочитаю работать под полную личную ответственность;',
            },
            {
                id: 5,
                text: 'готов(а) делать все, что нужно для организации.',
            },
        ],
    },
    {
        id: 3,
        text: 'Допустим, что Вам предлагают другую работу в Вашей организации. При каких условиях Вы бы на это согласились? Можете дать один или два варианта ответа:',
        quantity: 2,
        valuesArray: [
            {
                id: 1,
                text: 'если предложат намного более высокую зарплату;',
            },
            {
                id: 2,
                text: 'если другая работа будет более творческой и интересной, чем нынешняя;',
            },
            {
                id: 3,
                text: 'если новая работа даст мне больше самостоятельности;',
            },
            {
                id: 4,
                text: 'если это очень нужно для организации;',
            },
            {
                id: 5,
                text: 'при всех обстоятельствах я предпочел (предпочла) бы остаться на той работе, к которой привык (привыкла).',
            },
        ],
    },
    {
        id: 4,
        text: 'Попробуйте определить, что для Вас означает Ваш заработок? Можете дать один или два варианта ответа:',
        quantity: 2,
        valuesArray: [
            {
                id: 1,
                text: 'плата за время и усилия, потраченные на выполнение работы;',
            },
            {
                id: 2,
                text: 'это прежде всего плата за мои знания, квалификацию;',
            },
            {
                id: 3,
                text: 'оплата за общие результаты деятельности организации;',
            },
            {
                id: 4,
                text: 'мне нужен гарантированный заработок - пусть небольшой, но чтобы он был;',
            },
            {
                id: 5,
                text: 'какой бы он ни был, я его заработал(а) сам(а).',
            },
        ],
    },
    {
        id: 5,
        text: 'Заработная плата и премии:',
        quantity: 1,
        valuesArray: [
            {
                id: 1,
                text: 'очень важно;',
            },
            {
                id: 2,
                text: 'не очень важно;',
            },
            {
                id: 3,
                text: 'совсем не важно.',
            },
        ],
    },
    {
        id: 6,
        text: 'Доплаты за квалификацию:',
        quantity: 1,
        valuesArray: [
            {
                id: 1,
                text: 'очень важно;',
            },
            {
                id: 2,
                text: 'не очень важно;',
            },
            {
                id: 3,
                text: 'совсем не важно.',
            },
        ],
    },
    {
        id: 7,
        text: 'Доплаты за тяжелые и вредные условия работы:',
        quantity: 1,
        valuesArray: [
            {
                id: 1,
                text: 'очень важно;',
            },
            {
                id: 2,
                text: 'не очень важно;',
            },
            {
                id: 3,
                text: 'совсем не важно.',
            },
        ],
    },
    {
        id: 8,
        text: 'Социальные выплаты и льготы, пособия:',
        quantity: 1,
        valuesArray: [
            {
                id: 1,
                text: 'очень важно;',
            },
            {
                id: 2,
                text: 'не очень важно;',
            },
            {
                id: 3,
                text: 'совсем не важно.',
            },
        ],
    },
    {
        id: 9,
        text: 'Доходы от капитала, акций:',
        quantity: 1,
        valuesArray: [
            {
                id: 1,
                text: 'очень важно;',
            },
            {
                id: 2,
                text: 'не очень важно;',
            },
            {
                id: 3,
                text: 'совсем не важно.',
            },
        ],
    },
    {
        id: 10,
        text: 'Любые дополнительные приработки:',
        quantity: 1,
        valuesArray: [
            {
                id: 1,
                text: 'очень важно;',
            },
            {
                id: 2,
                text: 'не очень важно;',
            },
            {
                id: 3,
                text: 'совсем не важно.',
            },
        ],
    },
    {
        id: 11,
        text: 'Приработки, но не любые, а только по своей специальности:',
        quantity: 1,
        valuesArray: [
            {
                id: 1,
                text: 'очень важно;',
            },
            {
                id: 2,
                text: 'не очень важно;',
            },
            {
                id: 3,
                text: 'совсем не важно.',
            },
        ],
    },
    {
        id: 12,
        text: 'Доходы от личного хозяйства, данного участка и т.п.:',
        quantity: 1,
        valuesArray: [
            {
                id: 1,
                text: 'очень важно;',
            },
            {
                id: 2,
                text: 'не очень важно;',
            },
            {
                id: 3,
                text: 'совсем не важно.',
            },
        ],
    },
    {
        id: 13,
        text: 'Выигрыш в лотерею, казино и т.п.:',
        quantity: 1,
        valuesArray: [
            {
                id: 1,
                text: 'очень важно;',
            },
            {
                id: 2,
                text: 'не очень важно;',
            },
            {
                id: 3,
                text: 'совсем не важно.',
            },
        ],
    },
    {
        id: 14,
        text: 'На каких принципах, по вашему, должны строиться отношения между работником и организацией? Дайте только один ответ:',
        quantity: 1,
        valuesArray: [
            {
                id: 1,
                text: 'работник должен относиться к организации как к своему дому, отдавать ей все и вместе переживать трудности и подъемы. Организация должна соответственно оценивать преданность и труд работника;',
            },
            {
                id: 2,
                text: 'работник продает организации свой труд, и если ему не дают хорошую цену, он вправе найти другого покупателя;',
            },
            {
                id: 3,
                text: 'работник приходит в организацию для самореализации и относится к ней как к месту реализации своих способностей. Организация должна обеспечивать работнику такую возможность, извлекать из этого выгоду для себя и на этой основе развиваться;',
            },
            {
                id: 4,
                text: 'работник тратит на организацию свои силы, а организация должна взамен гарантировать ему зарплату и социальные блага.',
            },
        ],
    },
    {
        id: 15,
        text: 'Как Вы считаете, почему в процессе работы люди проявляют инициативу, вносят различные предложения? Можете дать один или два варианта ответа:',
        quantity: 2,
        valuesArray: [
            {
                id: 1,
                text: 'чувствуют особую ответственность за свою работу;',
            },
            {
                id: 2,
                text: 'из-за стремления реализовать свои знания и опыт, выйти за установленные работой рамки;',
            },
            {
                id: 3,
                text: 'чаще всего из-за желания улучшить работу своей организации;',
            },
            {
                id: 4,
                text: 'просто хотят выделиться или завоевать расположение начальства;',
            },
            {
                id: 5,
                text: 'хотят заработать, поскольку всякая полезная инициатива должна вознаграждаться.',
            },
        ],
    },
    {
        id: 16,
        text: 'Какое суждение о коллективной работе Вам ближе? Можете дать один или два варианта ответа:',
        quantity: 2,
        valuesArray: [
            {
                id: 1,
                text: 'коллектив для меня очень важен, одному хороших результатов не добиться;',
            },
            {
                id: 2,
                text: 'предпочитаю работать автономно, но чувствую себя так же хорошо, когда работаю вместе с интересными людьми;',
            },
            {
                id: 3,
                text: 'мне нужна свобода действий, а коллектив чаще всего эту свободу ограничивает;',
            },
            {
                id: 4,
                text: 'можно работать и в коллективе, но платить должны по личным результатам;',
            },
            {
                id: 5,
                text: 'мне нравится работать в коллективе, так как там я среди своих.',
            },
        ],
    },
    {
        id: 17,
        text: 'Представьте себе, что у Вас появилась возможность стать владельцем Вашей организации. Воспользуетесь ли Вы этой возможностью? Можете дать один или два варианта ответа:',
        quantity: 2,
        valuesArray: [
            {
                id: 1,
                text: 'да, так как я смогу участвовать в управлении организацией;',
            },
            {
                id: 2,
                text: 'да, потому что это может увеличить мой доход;',
            },
            {
                id: 3,
                text: 'да, так как настоящий работник должен быть совлпадельцем;',
            },
            {
                id: 4,
                text: 'вряд ли: на заработке это не скажется, участие в управлении меня не интересует, а работе это помешает;',
            },
            {
                id: 5,
                text: 'нет, не нужны мне лишние заботы.',
            },
        ],
    },
    {
        id: 18,
        text: 'Представьте, пожалуйста, что Вы сейчас ищете работу. Вам предлагают несколько работ. Какую из них Вы выберете? Можете дать один или два варианта ответа:',
        quantity: 2,
        valuesArray: [
            {
                id: 1,
                text: 'наиболее интересную, творческую;',
            },
            {
                id: 2,
                text: 'наиболее самостоятельную, независимую;',
            },
            {
                id: 3,
                text: 'за которую больше платят;',
            },
            {
                id: 4,
                text: 'чтобы за не слишком большие деньги не требовалось особенно "надрываться";',
            },
            {
                id: 5,
                text: 'не могу представить, что я уйду из нашей организации.',
            },
        ],
    },
    {
        id: 19,
        text: 'Что Вы прежде всего учитываете, когда оцениваете успехи другого работника в Вашей организации? Можете дать один или два варианта ответа:',
        quantity: 2,
        valuesArray: [
            {
                id: 1,
                text: 'его зарплату, доходы, материальное положение;',
            },
            {
                id: 2,
                text: 'уровень его профессионализма, квалификации;',
            },
            {
                id: 3,
                text: 'насколько хорошо он "устроился";',
            },
            {
                id: 4,
                text: 'насколько его уважают в организации;',
            },
            {
                id: 5,
                text: 'насколько он самостоятелен, независим.',
            },
        ],
    },
    {
        id: 20,
        text: 'Если положение в Вашей организации ухудшится, на какие перемены в Вашей работе и положении Вы согласитесь ради того, чтобы остаться на работе? Можете дать сколько угодно ответов:',
        quantity: 6,
        valuesArray: [
            {
                id: 1,
                text: 'освоить новую профессию;',
            },
            {
                id: 2,
                text: 'работать неполный рабочий день или перейти на менее квалифицированную работу и меньше получать;',
            },
            {
                id: 3,
                text: 'перейти на менее удобный режим работы;',
            },
            {
                id: 4,
                text: 'работать более интенсивно;',
            },
            {
                id: 5,
                text: 'соглашусь просто терпеть, потому что деваться некуда;',
            },
            {
                id: 6,
                text: 'скорее всего я просто уйду из этой организации.',
            },
        ],
    },
    {
        id: 21,
        text: 'Если Вы руководитель, то что Вас привлекает прежде всего в этом положении? Можете дать один или два варианта ответа:',
        quantity: 2,
        valuesArray: [
            {
                id: 1,
                text: 'возможность принимать самостоятельные, ответственные решения;',
            },
            {
                id: 2,
                text: 'возможность принести наибольшую пользу организации;',
            },
            {
                id: 3,
                text: 'высокий уровень оплаты;',
            },
            {
                id: 4,
                text: 'возможность организовывать работу других людей;',
            },
            {
                id: 5,
                text: 'возможность наилучшим образом применить свои знания и умения;',
            },
            {
                id: 6,
                text: 'ничего особенно не привлекает, за положение руководителя не держусь.',
            }
        ],
    },
    {
        id: 22,
        text: 'Если Вы не являетесь руководителем, то хотели бы Вы им стать? Можете дать один или два варианта ответа:',
        quantity: 2,
        valuesArray: [
            {
                id: 1,
                text: 'да, поскольку это даст возможность принимать самостоятельные, ответственные решения;',
            },
            {
                id: 2,
                text: 'не против, если это нужно для пользы дела;',
            },
            {
                id: 3,
                text: 'да, так как при этом я смогу лучше применить свои знания и умения;',
            },
            {
                id: 4,
                text: 'да, если это будет должны образом оплачиваться;',
            },
            {
                id: 5,
                text: 'нет, профессионал может отвечать только за самого себя;',
            },
            {
                id: 6,
                text: 'нет, руководство меня не привлекает, а хорошо заработать я могу и на своем месте;',
            },
            {
                id: 7,
                text: 'да, чем я хуже других;',
            },
            {
                id: 8,
                text: 'нет, это слишком большая нагрузка для меня.',
            },
        ],
    },
]