//Первый вариант

export const firstVar = [
    {
        id: 1,
        text: "Перчатки надевают или одевают?",
        vars: ["Надевают", "Одевают", "Оба варианта верны"],
    },
    {
        id: 2,
        text: "В каком случае ударения поставлены верно?",
        vars: ["кУхонный, деньгАми, творОг", "кухОнный, деньгАми, твОрог", "кУхонный, дЕньгами, твОрог"],
    },
    {
        id: 3,
        text: "В каком случае сочетания слов употреблены верно:",
        vars: ["Мой день рождения", "Мой день рождение", "Оба варианта"],
    },
    {
        id: 4,
        text: "В каком предложении вместо слова ПРЕДСТАВИТЬ нужно употребить ПРЕДОСТАВИТЬ?",
        vars: ["Журналистам ПРЕДСТАВИЛИ нового кандидата в мэры.", "Адвокат будет ПРЕДСТАВЛЯТЬ Ваши интересы в суде.", "Книга ПРЕДСТАВЛЯЕТ собой практическое руководство для специалистов, работающих в области юриспруденции и права.", "Гражданам ПРЕДСТАВЛЯЕТСЯ право выбора формы подачи документов."],
    },
    {
        id: 5,
        text: "Отметьте предложения, в которых нет речевых ошибок:",
        vars: ["Депутаты Государственной Думы стали в курсе этого решения лишь сегодня.", "У американцев не принято спрашивать, какие доходы они зарабатывают.", "Вопреки нашим ожиданиям утром пошел дождь."],
    },
    {
        id: 6,
        text: "В каком варианте ответа правильно указаны цифры, на месте которых в предложении должны стоять запятые?",
        addedText: "Гражданский служащий (1) получивший поручение (2) направленное (3) по его мнению (4) на совершение коррупционных действий (5) должен представить в письменной форме обоснование неправомерности (6) данного поручения.",
        vars: ["1, 2, 4, 5", "1, 2, 3, 4, 5", "1, 2, 5, 6", "1, 2, 3, 5, 6"],
    },
    {
        id: 7,
        text: "Укажите словосочетания, в которых нарушены нормы сочетаемости слов:",
        vars: ["предоставлять возможность", "надеемся на сотрудничество", "сказать радушные слова", "уделить серьезное значение"],
    },
    {
        id: 8,
        text: "В каком варианте ответа нет ошибок в употреблении предлогов?",
        vars: ["доложить по приезду", "согласно договора", "благодаря содействию", "вопреки прогноза"],
    },
    {
        id: 9,
        text: "В каком варианте ответа верно употреблены прописные и строчные буквы?",
        vars: ["московская школа, Московский Кремль", "краевой бюджет, Магаданская Область", "поволжские немцы, поволжский регион", "государственное учреждение, Европейские страны"],
    },
    {
        id: 10,
        text: "В каком варианте ответа все слова употреблены правильно?",
        vars: ["принимать к сведению", "неразрешимый тупик", "подвести результаты встречи", "оказать пользу"],
    },
    {
        id: 11,
        text: "В каком случае все слова пишутся с буквой А ",
        vars: ["заг_релый,  р_сти", "р_сток, р_сти", "оз_рение, р_сти"],
    },
    {
        id: 12,
        text: "Где необходимо раздельное написание НЕ- со словами.",
        vars: ["Не_догадывался, вовсе не _интересный", "Не_запланированные расходы; не_подготовленный вовремя отчет", "вовсе не _интересный, не_запланированные расходы"],
    },
    {
        id: 13,
        text: "В каких словах необходимо вставить -НН-.",
        vars: ["Стекля_ ый, реализова_ый  проект", "Стари_ый, плавле_ый  сырок", "изране_ый, управление образова_о  в 2007 году"],
    },
    {
        id: 14,
        text: "Отметьте предложение без тавтологии (повтора).",
        vars: ["Сегодня у нас в гостях друг из Свердловска.", "Ресторан предлагает посетителям изысканные деликатесы из свежей рыбы.", "Он рассказал нам о своих планах на будущее."],
    },
    {
        id: 15,
        text: "Домой мы купили пять килограммов ................",
        vars: ["апельсинов", "апельсин"],
    },
]

export const firstVarAnswers = [
    "Надевают",
    "кУхонный, деньгАми, творОг",
    "Мой день рождения",
    "Гражданам ПРЕДСТАВЛЯЕТСЯ право выбора формы подачи документов.",
    "Вопреки нашим ожиданиям утром пошел дождь.",
    "1, 2, 3, 4, 5",
    "уделить серьезное значение",
    "благодаря содействию",
    "московская школа, Московский Кремль",
    "принимать к сведению",
    "оз_рение, р_сти",
    "Не_догадывался, вовсе не _интересный",
    "Стекля_ ый, реализова_ый  проект",
    "Сегодня у нас в гостях друг из Свердловска.",
    "апельсинов",
]

//Второй вариант

export const secondVar = [
    {
        id: 1,
        text: "Руководитель поставил свою ________________",
        vars: ["Роспись ", "Подпись", "Оба варианта верны"],
    },
    {
        id: 2,
        text: "В каком случае ударения поставлены верно:",
        vars: ["сирОты, шАрфы, средствА", "сирОты, шАрфы, срЕдства", "сИроты, шАрфы, срЕдства"],
    },
    {
        id: 3,
        text: "В каком случае сочетания слов употреблены верно:",
        vars: ["Мое день рождение", "Мой день рождения", "Оба варианта"],
    },
    {
        id: 4,
        text: "В каком варианте ответа правильно указаны цифры, на месте которых в предложении должны стоять запятые?",
        addedText: "Трудности, которые испытывает семья (1) в том числе (2) связанные с экономическими проблемами (3) нередко (4) приводят к внутрисемейным конфликтам (5) в результате которых могут оказаться нарушенными права и законные интересы детей.",
        vars: ["1, 2, 3, 5", "1, 3, 4, 5", "1, 3, 5", "1, 2, 5"],
    },
    {
        id: 5,
        text: "Отметьте предложение, в котором нет речевых ошибок:",
        vars: ["Читая письмо, обратило на себя внимание большое количество стилистических ошибок.", "Планируется пригласить двадцать один спортсмен.", "Возникли определенные трудности, связанные  с доставкой стройматериалов."],
    },
    {
        id: 6,
        text: "В каком варианте ответа нет ошибок в употреблении предлогов?",
        vars: ["благодаря трудолюбия", "согласно приказу", "по прибытию на место", "наперекор установленных требований"],
    },
    {
        id: 7,
        text: "В каком варианте ответа все слова употреблены правильно?",
        vars: ["предпринимать усилия", "при нашем соучастии", "придавать глубокое значение", "аргументировать мнение"],
    },
    {
        id: 8,
        text: "В каком варианте ответа верно употреблены прописные и строчные буквы?",
        vars: ["органы государственной власти субъектов Российской Федерации", "высшие должностные лица Субъектов Российской Федерации", "Центральная избирательная Комиссия Российской Федерации", "руководители Фракций в Государственной Думе Федерального Собрания Российской "],
    },
    {
        id: 9,
        text: "Выберите вариант ответа, в котором двоеточие поставлено верно:",
        vars: ["Мировая практика показывает: вокруг мегаполисов складываются районы малоэтажной застройки.", "Не успеешь оглянуться: наступает день первой школьной линейки.", "Считаю: что лучших управленцев должна знать вся страна.", "У нас есть самое главное, в чём нуждается экономика: это профессиональные кадры и огромный рынок."],
    },
    {
        id: 10,
        text: "Выберите вариант ответа, в котором предложение построено без ошибок",
        vars: ["Уполномоченные мэром государственные органы самостоятельно образуют внебюджетные фонды и распоряжаются ими", "Подготовка охотников для истребления волков и лиц, ответственных за проведение этого мероприятия", "Глава местной администрации распределяет и управляет имуществом и финансами", "Реализация федеральной программы затрагивает как интересы Росстата, так и других министерств и ведомств"],
    },
    {
        id: 11,
        text: "В каком случае все слова пишутся с буквой И",
        vars: ["он слыш_т,  пр_поднять", "пр_одолеть,  пр_зидент", "раз_грать,  пр_поднять"],
    },
    {
        id: 12,
        text: "Где необходимо раздельное написание НЕ- со словами.",
        vars: ["не_смотря на трудности, никому не_интересно", "не_задумываясь о последствиях, не_исследованная область знаний", "отнюдь не_дорогой костюм, документ не_подписан"],
    },
    {
        id: 13,
        text: "В каких словах необходимо вставить -НН-.",
        vars: ["чугу_ый, перевяза_ая рука", "осозна_ый  поступок, соловьи_ый", "соловьи_ый деревя_ый"],
    },
    {
        id: 14,
        text: "Отметьте предложение без тавтологии (повтора).",
        vars: ["Впервые мы познакомились на новогоднем вечере.", "В  автобиографии вы не указали последнее место работы.", "Сегодня получено информационное сообщение  о  приближающемся  урагане."],
    },
    {
        id: 15,
        text: "Домой мы купили пять килограммов ................",
        vars: ["помидоров", "помидор"],
    },
]

export const secondVarAnswers = [
    "Подпись",
    "сирОты, шАрфы, срЕдства",
    "Мой день рождения",
    "1, 3, 5",
    "Возникли определенные трудности, связанные  с доставкой стройматериалов.",
    "согласно приказу",
    "аргументировать мнение",
    "органы государственной власти субъектов Российской Федерации",
    "Мировая практика показывает: вокруг мегаполисов складываются районы малоэтажной застройки.",
    "Уполномоченные мэром государственные органы самостоятельно образуют внебюджетные фонды и распоряжаются ими",
    "он слыш_т,  пр_поднять",
    "отнюдь не_дорогой костюм, документ не_подписан",
    "чугу_ый, перевяза_ая рука",
    "В  автобиографии вы не указали последнее место работы.",
    "помидоров",
]

//Третий вариант

export const thirdVar = [
    {
        id: 1,
        addedText: "Прошу … к награде",
        text: "Отметьте правильный вариант написания:",
        vars: ["Представить", "Предоставить", "Оба варианта верны"],
    },
    {
        id: 2,
        text: "В каком случае ударения поставлены верно:",
        vars: ["срЕдства, сливОвый, звонИт", "срЕдства, слИвовый, звонИт", "средствА, слИвовый, звОни"],
    },
    {
        id: 3,
        text: "В каком случае сочетания слов употреблены верно:",
        vars: ["С днем рожденья", "С днем рождения", "Оба варианта"],
    },
    {
        id: 4,
        text: "В каком варианте ответа верно употреблены прописные и строчные буквы?",
        vars: ["дирекция Мясокомбината, казанская школа", "Центральная Избирательная Комиссия Российской Федерации, Московский Кремль", "Великая Отечественная война, Московский Кремль", "казанская школа, президент России"],
    },
    {
        id: 5,
        text: "Отметьте предложение, в котором нет речевых ошибок.",
        vars: ["Тридцать один специалист участвовал в этом совещании.", "Текучесть кадров порождает недостаточное внимание администрации.", "Принимая этот препарат, ваш вес уменьшится."],
    },
    {
        id: 6,
        text: "В каком варианте ответа правильно указаны цифры, на месте которых в предложении должны стоять запятые?",
        addedText: "Валовой (1) внутренний продукт является тем показателем (2) на основании (3) которого производится (4) разделение стран на развитые и развивающиеся.",
        vars: ["1, 2", "2", "3, 4", "3"],
    },
    {
        id: 7,
        text: "В каком варианте ответа нет ошибок в употреблении предлогов?",
        vars: ["благодаря содействию", "доложить по приезду", "согласно договора", "вопреки прогноза"],
    },
    {
        id: 8,
        text: "В каком варианте ответа все слова употреблены правильно?",
        vars: ["разъяснения о допущенных ошибках", "сдать вовремя благодаря четкой работы", "оперировать с точными данными", "подчеркнуть необходимость строительства"],
    },
    {
        id: 9,
        text: "Выберите вариант ответа, в котором предложение построено без ошибок",
        vars: ["Сохраняя традиции нашей культуры, государство должно позаботиться и о тех, кто ищет новые пути в художественном творчестве.", "Изучая проблемы городского транспорта, учеными были получены интересные результаты.", "Ремонтные работы завершены досрочно, понимая важность объекта.", "Иск удовлетворен, обязав ответчика заключить договор на условиях истца."],
    },
    {
        id: 10,
        text: "Выберите неправильный вариант",
        vars: ["у сотрудника Василия Мицкевича", "у сотрудницы Алины Мицкевич", "у сотрудника Василия Мицкевич", "разговор с Иваном Седых"],
    },
    {
        id: 11,
        text: "В каком случае все слова пишутся с буквой Е",
        vars: ["ш_рты, пр_емник (последователь)", "стаж_р, небез_вестный ", "она дремл_т, дел_гировать"],
    },
    {
        id: 12,
        text: "Где необходимо раздельное написание НЕ- со словами.",
        vars: ["задача не_решена; виделись не_давно", "не_яркие, а блеклые краски; не_прочитанная мною книга", "не_регулируемый перекресток; задача не_решена"],
    },
    {
        id: 13,
        text: "В каких словах необходимо вставить -НН-.",
        vars: ["Кожа_ый, ране_ый в руку", "Це_ый, перекраше_ый", "Жаре_ый картофель оловя_ый"],
    },
    {
        id: 14,
        text: "Какое слово является антонимом к слову ЭФФЕКТИВНЫЙ:",
        vars: ["безрезультатный", "плодотворный"],
    },
    {
        id: 15,
        text: "Бабушка передала нам пять …………………… яблок.",
        vars: ["килограмм", "килограммов"],
    },
]

export const thirdVarAnswers = [
    "Представить",
    "срЕдства, слИвовый, звонИт",
    "С днем рождения",
    "Великая Отечественная война, Московский Кремль",
    "Тридцать один специалист участвовал в этом совещании.",
    "2",
    "благодаря содействию",
    "подчеркнуть необходимость строительства",
    "Сохраняя традиции нашей культуры, государство должно позаботиться и о тех, кто ищет новые пути в художественном творчестве.",
    "у сотрудника Василия Мицкевич",
    "она дремл_т, дел_гировать",
    "не_яркие, а блеклые краски; не_прочитанная мною книга",
    "Це_ый, перекраше_ый",
    "безрезультатный",
    "килограммов",
]

//Четвертый вариант

export const fourthVar = [
    {
        id: 1,
        text: "Отметьте правильный вариант написания:",
        addedText: "Всем сотрудникам необходимо ____________  на медицинский осмотр",
        vars: ["Прийти", "Придти", "Оба варианта"],
    },
    {
        id: 2,
        text: "В каком случае ударения поставлены верно:",
        vars: ["тОрты, щАвель, латтЕ", "тОрты, щавЕль, лАтте", "тортЫ, щавЕль, латтЕ "],
    },
    {
        id: 3,
        text: "В каком случае сочетания слов употреблены верно:",
        vars: ["Окончить школу", "Закончить школу", "Оба варианта"],
    },
    {
        id: 4,
        text: "В каком варианте ответа правильно указаны цифры, на месте которых в предложении должны стоять запятые?",
        addedText: "Налоговая декларация представляется каждым налогоплательщиком (1) по каждому налогу (2) подлежащему уплате (3) этим налогоплательщиком (4) если иное не предусмотрено законодательством о налогах и сборах.",
        vars: ["2, 4", "1, 2, 4", "2, 3, 4", "1, 2, 3, 4"],
    },
    {
        id: 5,
        text: "Отметьте предложение, в котором нет речевых ошибок:",
        vars: ["Директор свое главное внимание уделял воспитательной работе.", "Разрушения произошли за счет плохой работы системы водоснабжения.", "Особое внимание на совещании было уделено проблемам молодежи."],
    },
    {
        id: 6,
        text: "В каком варианте ответа допущена ошибка в употреблении предлога",
        vars: ["действовать согласно указа", "действовать согласно указаниям", "прийти вопреки желанию", "одержать победу благодаря совету"],  
    },
    {
        id: 7,
        text: "Выберите неправильный вариант",
        vars: ["у сотрудника Василия Мицкевича", "у сотрудника Алины Мицкевич", "у сотрудника Василия Мицкевич", "разговор с Иваном Седых"],
    },
    {
        id: 8,
        text: "В каком предложении вместо слова ПРЕДСТАВИТЬ нужно употребить ПРЕДОСТАВИТЬ?",
        vars: ["Налоговая должна ПРЕДСТАВИТЬ вычет", "Адвокат будет ПРЕДСТАВЛЯТЬ Ваши интересы в суде.", "Учебник ПРЕДСТАВЛЯЕТ собой комплексную подборку статей", "Гражданам ПРЕДСТАВИЛИ нового судью соревнований"],
    },
    {
        id: 9,
        text: "Выберите вариант ответа, в котором двоеточие поставлено верно:",
        vars: ["Мировая практика показывает: вокруг мегаполисов складываются районы малоэтажной застройки.", "Не успеешь оглянуться: наступает день первой школьной линейки.", "Считаю: что лучших управленцев должна знать вся страна.", "У нас есть самое главное, в чём нуждается экономика: это профессиональные кадры и огромный рынок."],
    },
    {
        id: 10,
        text: "В каком варианте ответа верно употреблены прописные и строчные буквы?",
        vars: ["Французская Республика, Президент России", "Тульская область, Поволжские немцы", "Московский Театр оперетты, греческие города", "Красивый Шпиц, Великая отечественная война"],
    },
    {
        id: 11,
        text: "В каком случае все слова пишутся с буквой И",
        vars: ["пр_одолеть, слово пиш_тся  по правилу", "пр_поднять, он слыш_т", "раз_грать, пр_болел"],
    },
    {
        id: 12,
        text: "Где необходимо раздельное написание НЕ- со словами.",
        vars: ["не дорогая, а дешевая книга; совершенно неподготовленный доклад", "ушел, не купив ничего; никому не известно ", "не разрезанный на части пирог; нек  онтролируемый  участок"],
    },
    {
        id: 13,
        text: "В каких словах необходимо вставить -НН-.",
        vars: ["серебря_ый, сваре_ое мясо", "смороди_ый, стра_ый", "задание выполне_о, варе_ое  мясо"],
    },
    {
        id: 14,
        text: "Какое слово является антонимом к слову СОВОКУПНОСТЬ",
        vars: ["разрозненность", "комплекс"],
    },
    {
        id: 15,
        text: "В поездку пришлось взять с собой 2 пары …………………",
        vars: ["чулок", "чулков"],
    },
]

export const fourthVarAnswers = [
    "Прийти",
    "тОрты, щавЕль, лАтте",
    "Окончить школу",
    "2, 4",
    "Особое внимание на совещании было уделено проблемам молодежи.",
    "действовать согласно указа",
    "у сотрудника Василия Мицкевич",
    "Налоговая должна ПРЕДСТАВИТЬ вычет",
    "Мировая практика показывает: вокруг мегаполисов складываются районы малоэтажной застройки.",
    "Французская Республика, Президент России",
    "пр_поднять, он слыш_т",
    "ушел, не купив ничего; никому не известно ",
    "смороди_ый, стра_ый",
    "разрозненность",
    "чулок",
]

//Пятый выриант

export const fifthVar = [
    {
        id: 1,
        text: "Отметьте правильный вариант написания:",
        addedText: "Вам необходимо ______________ справку",
        vars: ["Представить", "Предоставить", "Оба варианта верны"],
    },
    {
        id: 2,
        text: "В каком случае ударения поставлены верно:",
        vars: ["договОр, йОгурт, катАлог", "дОговор, йогУрт, катАлог", "договОр, йОгурт, каталОг"],
    },
    {
        id: 3,
        text: "В каком случае сочетания слов употреблены верно:",
        vars: ["Мы не обращали внимание на людей.", "Мы не обращали внимания на людей.", "Оба варианта"],
    },
    {
        id: 4,
        text: "Отметьте предложение, в котором нет речевых ошибок:",
        vars: ["Для участия в соревнованиях предполагается пригласить тридцать одного спортсмена.", "Благодаря недостаточности освещения, многие растения гибнут.", "По окончанию обучения  слушателям выдаются удостоверения."],
    },
    {
        id: 5,
        text: "В каком варианте ответа правильно указаны цифры, на месте которых в предложении должны стоять запятые?",
        addedText: "Государственные служащие (1) сознавая ответственность перед государством, обществом и гражданами (2) призваны исходить из того (3) что признание, соблюдение и защита (4) прав и свобод человека и гражданина определяют основной смысл и содержание деятельности (5) как государственных органов, так и государственных служащих",
        vars: ["1, 2, 3", "1, 3, 4, 5", "1, 3, 5", "1, 2, 3, 5"],
    },
    {
        id: 6,
        text: "Выберите неправильный вариант",
        vars: ["отдал начальнику Антону Паламарчуку", "отдал специалисту Анне Паламарчук", "отдал специалисту Антону Паламарчук", "разговор с Василием Белых"],
    },
    {
        id: 7,
        text: "В каком варианте ответа допущена ошибка в употреблении предлога",
        vars: ["благодаря трудолюбию", "согласно приказу", "по прибытию на место", "наперекор установленным требованиям"],
    },
    {
        id: 8,
        text: "В каком варианте ответа верно употреблены прописные и строчные буквы?",
        vars: ["дирекция мясокомбината, президент России", "Центральная Избирательная Комиссия Российской Федерации, дирекция мясокомбината", "Великая отечественная война, Московский Кремль", "казанская школа, Президент России"],
    },
    {
        id: 9,
        text: "Выберите вариант ответа, в котором все слова пишутся слитно",
        vars: ["(юго) западный, (причинно) следственный", "(Санкт) Петербург, (железно) дорожный", "(высоко) продуктивный, (военно) обязанный"],
    },
    {
        id: 10,
        text: "Укажите словосочетания, в которых нарушены нормы сочетаемости слов:",
        vars: ["предоставлять возможность", "уделить серьезное значение ", "надеемся на сотрудничество", "сказать радушные слова"],
    },
    {
        id: 11,
        text: "В каком случае все слова пишутся с буквой Ы",
        vars: ["дез_нформация, от_грать", "без_скусственный, под_скать", "меж_нститутский, вз_мать"],
    },
    {
        id: 12,
        text: "Где необходимо раздельное написание НЕ- со словами.",
        vars: ["контрольная карточка не_закрыта; никем не_узнанный", "не_готов к сдаче в эксплуатацию; не_замеченная ошибка", "работа  не_завершена, не_глубокий овраг"],
    },
    {
        id: 13,
        text: "В каких словах необходимо вставить -НН-.",
        vars: ["ответстве_ость; бракова_ый товар ", "баклажа_ая; работа провере_а", "перереза_ый; черне_ое серебро"],
    },
    {
        id: 14,
        text: "Какое слово является антонимом к слову ГЛУБОКИЙ",
        vars: ["основательный", "поверхностный"],
    },
    {
        id: 15,
        text: "В поездку пришлось взять с собой 2 пары теплых ………………",
        vars: ["носков", "носок"],
    },
]

export const fifthVarAnswers = [
    "Предоставить",
    "договОр, йОгурт, каталОг",
    "Мы не обращали внимания на людей.",
    "Для участия в соревнованиях предполагается пригласить тридцать одного спортсмена.",
    "1, 2, 3",
    "отдал специалисту Антону Паламарчук",
    "по прибытию на место",
    "казанская школа, Президент России",
    "(высоко) продуктивный, (военно) обязанный",
    "уделить серьезное значение ",
    "без_скусственный, под_скать",
    "контрольная карточка не_закрыта; никем не_узнанный",
    "ответстве_ость; бракова_ый товар ",
    "поверхностный",
    "носков",
]